In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
# Access the Data. The data is grouped into quarterly files downloaded from Bris City Council website. Need to import all 8 quarterly data files and add the month ending for the Quarter for each file
df_complaints_q2fy19 = pd.read_csv('../Assignment/animal-related-complaints-q2_fy19.csv')

In [4]:
#add the specific date column 'Quarter_Ending'. This is required as date is only referenced in file name, not the actual data values.
df_complaints_q2fy19['Quarter_Ending'] = '2018-12'
df_complaints_q2fy19

,Category: Nature,Category: Type,Category: Reporting Level,Location: Suburb,Quarter_Ending
0,Animal,Cat,Wandering,GAYTHORNE,2018-12
1,Animal,Dog,Fencing Issues,CHAPEL HILL,2018-12
2,Animal,Attack,Attack On A Person,ASPLEY,2018-12
3,Animal,Attack,NaN,JAMBOREE HEIGHTS,2018-12
4,Animal,Cat,Wandering,ASHGROVE,2018-12
...,...,...,...,...,...
1963,Animal,Other Animal,Fox,CHANDLER,2018-12
1964,Animal,Other Animal,Fencing Issues,COOPERS PLAINS,2018-12
1965,Animal,Dog,Fencing Issues,ZILLMERE,2018-12
1966,Animal,Dog,Fencing Issues,ZILLMERE,2018-12
1967,Animal,Other Animal,Fox,JAMBOREE HEIGHTS,2018-12

In [5]:
#complete same process for remaining 7 files for each of the quarterly data periods
df_complaints_q3fy19 = pd.read_csv('../Assignment/animal-related-complaints-q3_fy19.csv')

In [6]:
df_complaints_q3fy19['Quarter_Ending'] = '2019-03'
df_complaints_q3fy19

,Category: Nature,Category: Type,Category: Reporting Level,Location: Suburb,Office: Responsible Office,Quarter_Ending
0,Animal,Dog,Wandering,STAFFORD,City Safety (Animal Management),2019-03
1,Animal,Cat Trapping,NaN,TARRAGINDI,Environmental Management Team,2019-03
2,Animal,Attack,Attack On An Animal,ACACIA RIDGE,Enforcement Animal Attack,2019-03
3,Animal,Cat Trapping,NaN,FITZGIBBON,Environmental Management Team,2019-03
4,Animal,Cat Trapping,NaN,MANLY WEST,Environmental Management Team,2019-03
...,...,...,...,...,...,...
1785,Animal,Cat Trapping,NaN,DEAGON,Environmental Management Team,2019-03
1786,Animal,Other Animal,Fox,SHERWOOD,Environmental Management Team,2019-03
1787,Animal,Dog,Wandering,SEVENTEEN MILE ROCKS,City Safety (Animal Management),2019-03
1788,Animal,Cat Trapping,NaN,CLAYFIELD,Environmental Management Team,2019-03
1789,Animal,Cat,Wandering,FITZGIBBON,City Safety Assessments Team,2019-03

In [7]:
df_complaints_q4fy19 = pd.read_csv('../Assignment/animal-related-complaints-q4_fy19.csv')

In [8]:
df_complaints_q4fy19['Quarter_Ending'] = '2019-06'

In [9]:
df_complaints_q1fy20 = pd.read_csv('../Assignment/animal-related-complaints-q1_fy20.csv')

In [10]:
df_complaints_q1fy20['Quarter_Ending'] = '2019-09'

In [11]:
df_complaints_q2fy20 = pd.read_csv('../Assignment/animal-related-complaints-q2_fy20.csv')

In [12]:
 df_complaints_q2fy20['Quarter_Ending'] = '2019-12'

In [13]:
df_complaints_q3fy20 = pd.read_csv('../Assignment/animal-related-complaints-q3_fy20.csv')

In [14]:
 df_complaints_q3fy20['Quarter_Ending'] = '2020-03'

In [15]:
df_complaints_q4fy20 = pd.read_csv('../Assignment/animal-related-complaints-q4_fy20.csv')

In [16]:
 df_complaints_q4fy20['Quarter_Ending'] = '2020-06'

In [17]:
df_complaints_q1fy21 = pd.read_csv('../Assignment/animal-related-complaints-q1_fy21.csv')

In [18]:
df_complaints_q1fy21['Quarter_Ending'] = '2020-09'

In [19]:
#combine the 8 files into one data set
combined_8qtrs = pd.concat([df_complaints_q2fy19, df_complaints_q3fy19, df_complaints_q4fy19, df_complaints_q1fy20, df_complaints_q2fy20, df_complaints_q3fy20, df_complaints_q4fy20, df_complaints_q1fy21], axis=0)

In [20]:
#check the data
combined_8qtrs.head(-10)

,Category: Nature,Category: Type,Category: Reporting Level,Location: Suburb,Quarter_Ending,Office: Responsible Office
0,Animal,Cat,Wandering,GAYTHORNE,2018-12,NaN
1,Animal,Dog,Fencing Issues,CHAPEL HILL,2018-12,NaN
2,Animal,Attack,Attack On A Person,ASPLEY,2018-12,NaN
3,Animal,Attack,NaN,JAMBOREE HEIGHTS,2018-12,NaN
4,Animal,Cat,Wandering,ASHGROVE,2018-12,NaN
...,...,...,...,...,...,...
2595,Animal,Attack,NaN,BRACKEN RIDGE,2020-09,NaN
2596,Animal,Dog,Wandering,GREENSLOPES,2020-09,NaN
2597,Animal,Dog,Fencing Issues,ANNERLEY,2020-09,NaN
2598,Animal,Attack,Attack On An Animal,FERNY GROVE,2020-09,NaN
2599,Animal,Dog,Unregistered,MITCHELTON,2020-09,NaN

In [21]:
#check the data
combined_8qtrs.info

<bound method DataFrame.info of      Category: Nature Category: Type Category: Reporting Level  \
0              Animal            Cat                 Wandering
1              Animal            Dog            Fencing Issues
2              Animal         Attack        Attack On A Person
3              Animal         Attack                       NaN
4              Animal            Cat                 Wandering
...               ...            ...                       ...
2605           Animal            Dog                 Wandering
2606           Animal         Attack             Not An Attack
2607           Animal            Dog      Park Patrol Reactive
2608           Animal            Cat                       NaN
2609           Animal            Cat                       NaN

      Location: Suburb Quarter_Ending Office: Responsible Office
0            GAYTHORNE        2018-12                        NaN
1          CHAPEL HILL        2018-12                        NaN
2               ASPLEY        2018-12                        NaN
3     JAMBOREE HEIGHTS        2018-12                        NaN
4             ASHGROVE        2018-12                        NaN
...                ...            ...                        ...
2605         CHERMSIDE        2020-09                        NaN
2606          BOONDALL        2020-09                        NaN
2607            NUDGEE        2020-09                        NaN
2608          ZILLMERE        2020-09                        NaN
2609           GEEBUNG        2020-09                        NaN

[17250 rows x 6 columns]>

In [22]:
#review the values for key columns to check they look ok
len(combined_8qtrs['Category: Reporting Level'].unique()), combined_8qtrs['Category: Reporting Level'].unique()

(26,
 array(['Wandering', 'Fencing Issues', 'Attack On A Person', nan,
        'Unregistered', 'Attack On An Animal', 'Nuisance Animal', 'Rabbit',
        'Defecating In Public', 'Fox', 'Not An Attack', 'Wild Dog',
        'Odour', 'Menacing', 'Too Many Animals', 'Deer',
        'Pest / Feral Animal', 'Feral Cat', 'Dangerous', 'Surrender',
        'Feral Pig', 'Insufficient Space', 'Dog', 'Feral Goat',
        'Park Patrol Reactive', 'Park Patrol Proactive'], dtype=object))

In [23]:
len(combined_8qtrs['Location: Suburb'].unique()), combined_8qtrs['Location: Suburb'].unique()

(188,
 array(['GAYTHORNE', 'CHAPEL HILL', 'ASPLEY', 'JAMBOREE HEIGHTS',
        'ASHGROVE', 'KENMORE', 'MOUNT GRAVATT EAST', 'ACACIA RIDGE',
        'DARRA', 'WISHART', 'ZILLMERE', 'STAFFORD HEIGHTS', 'KEPERRA',
        'FORTITUDE VALLEY', 'CHANDLER', 'GUMDALE', 'CARSELDINE', 'RUNCORN',
        'CAMP HILL', 'SHORNCLIFFE', 'NUDGEE BEACH', 'DUTTON PARK',
        'GEEBUNG', 'ASCOT', 'SHERWOOD', 'FERNY GROVE', 'ARCHERFIELD',
        'WYNNUM WEST', 'BRACKEN RIDGE', 'NORTHGATE', 'MOUNT COOT-THA',
        'BRISBANE CITY', 'WYNNUM', 'INALA', 'BRIGHTON', 'PADDINGTON',
        'TINGALPA', 'MITCHELTON', 'BOONDALL', 'HOLLAND PARK WEST',
        'NUNDAH', 'PULLENVALE', 'KEDRON', 'FAIRFIELD', 'ALDERLEY',
        'YERONGA', 'SALISBURY', 'MORNINGSIDE', 'GREENSLOPES',
        'SINNAMON PARK', 'CARINDALE', 'MANLY', 'WOOLLOONGABBA', 'WESTLAKE',
        'WACOL', 'MURARRIE', 'UPPER BROOKFIELD', 'UPPER MOUNT GRAVATT',
        'WINDSOR', 'KHOLO', 'KARANA DOWNS', 'RED HILL',
        'EIGHT MILE PLAINS', 'CORINDA', 'OXLEY', 'BALD HILLS', 'MACGREGOR',
        'KELVIN GROVE', 'ROCHEDALE', 'DREWVALE', 'KURABY', 'BARDON',
        'JINDALEE', 'HOLLAND PARK', 'SANDGATE', 'ANNERLEY', 'MIDDLE PARK',
        'FOREST LAKE', 'COOPERS PLAINS', 'MOOROOKA', 'CARINA',
        'BROOKFIELD', nan, 'STRETTON', 'KANGAROO POINT', 'WAKERLEY',
        'LOTA', 'FIG TREE POCKET', 'HAWTHORNE', 'THE GAP', 'HAMILTON',
        'MOUNT GRAVATT', 'MCDOWALL', 'MILTON', 'BALMORAL', 'ELLEN GROVE',
        'NORMAN PARK', 'CARINA HEIGHTS', 'EVERTON PARK', 'PINJARRA HILLS',
        'BOWEN HILLS', 'COORPAROO', 'RICHLANDS', 'WOOLOOWIN',
        'WAVELL HEIGHTS', 'TARRAGINDI', 'GRACEVILLE', 'NEWMARKET',
        'ROBERTSON', 'AUCHENFLOWER', 'NUDGEE', 'CHERMSIDE',
        'SUNNYBANK HILLS', 'KALINGA', 'PETRIE TERRACE', 'HEMMANT',
        'WILLAWONG', 'GRANGE', 'INDOOROOPILLY', 'RANSOME', 'CLAYFIELD',
        'NEW FARM', 'HENDRA', 'HERSTON', 'SUNNYBANK', 'BELMONT',
        'STONES CORNER', 'VIRGINIA', 'MANLY WEST', 'BULIMBA', 'STAFFORD',
        'SEVEN HILLS', 'BANYO', 'HEATHWOOD', 'CHERMSIDE WEST',
        'HIGHGATE HILL', 'ALGESTER', 'FITZGIBBON', 'EAST BRISBANE',
        'RIVERHILLS', 'DURACK', 'KARAWATHA', 'MOUNT CROSBY',
        'SEVENTEEN MILE ROCKS', 'TARINGA', 'DOOLANDELLA', 'WEST END',
        'ST LUCIA', 'CALAMVALE', 'ANSTEAD', 'MANSFIELD', 'PARKINSON',
        'TAIGUM', 'BRIDGEMAN DOWNS', 'TOOWONG', 'LUTWYCHE', 'CHELMER',
        'UPPER KEDRON', 'BELLBOWRIE', 'NEWSTEAD', 'MOUNT OMMANEY',
        'PINKENBA', 'GORDON PARK', 'CHUWAR', 'CANNON HILL', 'MACKENZIE',
        'ENOGGERA', 'WILSTON', 'MOGGILL', 'DEAGON', 'BURBANK', 'ROCKLEA',
        'ALBION', 'SPRING HILL', 'BRISBANE AIRPORT', 'PALLARA',
        'LAKE MANCHESTER', 'NATHAN', 'KENMORE HILLS', 'SOUTH BRISBANE',
        'TENERIFFE', 'SUMNER', 'YEERONGPILLY', 'TENNYSON', 'LYTTON',
        'EAGLE FARM', 'PORT OF BRISBANE', 'MORETON ISLAND'], dtype=object))

In [24]:
len(combined_8qtrs['Category: Type'].unique()), combined_8qtrs['Category: Type'].unique()

(5,
 array(['Cat', 'Dog', 'Attack', 'Other Animal', 'Cat Trapping'],
       dtype=object))

In [25]:
#further inspection of data quality
combined_8qtrs.describe

<bound method NDFrame.describe of      Category: Nature Category: Type Category: Reporting Level  \
0              Animal            Cat                 Wandering
1              Animal            Dog            Fencing Issues
2              Animal         Attack        Attack On A Person
3              Animal         Attack                       NaN
4              Animal            Cat                 Wandering
...               ...            ...                       ...
2605           Animal            Dog                 Wandering
2606           Animal         Attack             Not An Attack
2607           Animal            Dog      Park Patrol Reactive
2608           Animal            Cat                       NaN
2609           Animal            Cat                       NaN

      Location: Suburb Quarter_Ending Office: Responsible Office
0            GAYTHORNE        2018-12                        NaN
1          CHAPEL HILL        2018-12                        NaN
2               ASPLEY        2018-12                        NaN
3     JAMBOREE HEIGHTS        2018-12                        NaN
4             ASHGROVE        2018-12                        NaN
...                ...            ...                        ...
2605         CHERMSIDE        2020-09                        NaN
2606          BOONDALL        2020-09                        NaN
2607            NUDGEE        2020-09                        NaN
2608          ZILLMERE        2020-09                        NaN
2609           GEEBUNG        2020-09                        NaN

[17250 rows x 6 columns]>

In [26]:
#check for missing data
combined_8qtrs.isna().sum()

Category: Nature                  0
Category: Type                    0
Category: Reporting Level      2895
Location: Suburb                178
Quarter_Ending                    0
Office: Responsible Office    13317
dtype: int64

In [27]:
#check % missing values for columms
missing_values = (combined_8qtrs.isna().sum() / combined_8qtrs.shape[0]) * 100
missing_values

Category: Nature               0.000000
Category: Type                 0.000000
Category: Reporting Level     16.782609
Location: Suburb               1.031884
Quarter_Ending                 0.000000
Office: Responsible Office    77.200000
dtype: float64

In [28]:
missing_values[(missing_values <= 10) & (missing_values > 0)].head(10)
missing_values

Category: Nature               0.000000
Category: Type                 0.000000
Category: Reporting Level     16.782609
Location: Suburb               1.031884
Quarter_Ending                 0.000000
Office: Responsible Office    77.200000
dtype: float64

In [29]:
#idendify columns with less than 10% missing values but GT 0
missing_values[(missing_values <= 10) & (missing_values >0)].head()

Location: Suburb    1.031884
dtype: float64

In [30]:
#given the small size and critical nature of 'suburb' categoryto whole analysis, decision taken to drop missing suburb data
mask_drop_row = (missing_values <= 10) & (missing_values > 0)

In [31]:
row_to_drop = list((missing_values[(missing_values <= 10) & (missing_values > 0)]).index)
row_to_drop

['Location: Suburb']

In [32]:
df_clean = combined_8qtrs.dropna(subset=row_to_drop, axis=0).copy()

In [33]:
# check the change and understand the % missing data now
(df_clean.isna().sum() / df_clean.shape[0]) * 100

Category: Nature               0.000000
Category: Type                 0.000000
Category: Reporting Level     16.928304
Location: Suburb               0.000000
Quarter_Ending                 0.000000
Office: Responsible Office    77.079428
dtype: float64

In [34]:
# remove Responsible Office column as very high proportion of missing data so this data of little value
df_clean.drop('Office: Responsible Office', axis=1, inplace=True)

In [35]:
#check change

df_clean.head()

,Category: Nature,Category: Type,Category: Reporting Level,Location: Suburb,Quarter_Ending
0,Animal,Cat,Wandering,GAYTHORNE,2018-12
1,Animal,Dog,Fencing Issues,CHAPEL HILL,2018-12
2,Animal,Attack,Attack On A Person,ASPLEY,2018-12
3,Animal,Attack,NaN,JAMBOREE HEIGHTS,2018-12
4,Animal,Cat,Wandering,ASHGROVE,2018-12

In [36]:
#check most common / frequent values for each column to get indication on Reporting_Level missing data solution
df_clean.mode()

,Category: Nature,Category: Type,Category: Reporting Level,Location: Suburb,Quarter_Ending
0,Animal,Dog,Wandering,INALA,2020-06

In [37]:
#re-check data types
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17072 entries, 0 to 2609
Data columns (total 5 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Category: Nature           17072 non-null  object
 1   Category: Type             17072 non-null  object
 2   Category: Reporting Level  14182 non-null  object
 3   Location: Suburb           17072 non-null  object
 4   Quarter_Ending             17072 non-null  object
dtypes: object(5)
memory usage: 800.2+ KB

In [38]:
#simplify column titles
df_clean.rename(columns={'Category: Nature': 'Nature', 'Category: Type': 'Type', 'Category: Reporting Level': 'Reporting_Level', 'Location: Suburb': 'Suburb'}, inplace=True)
print(df_clean)

      Nature    Type       Reporting_Level            Suburb Quarter_Ending
0     Animal     Cat             Wandering         GAYTHORNE        2018-12
1     Animal     Dog        Fencing Issues       CHAPEL HILL        2018-12
2     Animal  Attack    Attack On A Person            ASPLEY        2018-12
3     Animal  Attack                   NaN  JAMBOREE HEIGHTS        2018-12
4     Animal     Cat             Wandering          ASHGROVE        2018-12
...      ...     ...                   ...               ...            ...
2605  Animal     Dog             Wandering         CHERMSIDE        2020-09
2606  Animal  Attack         Not An Attack          BOONDALL        2020-09
2607  Animal     Dog  Park Patrol Reactive            NUDGEE        2020-09
2608  Animal     Cat                   NaN          ZILLMERE        2020-09
2609  Animal     Cat                   NaN           GEEBUNG        2020-09

[17072 rows x 5 columns]

In [39]:
#check new df
df_clean.head()

   Nature    Type     Reporting_Level            Suburb Quarter_Ending
0  Animal     Cat           Wandering         GAYTHORNE        2018-12
1  Animal     Dog      Fencing Issues       CHAPEL HILL        2018-12
2  Animal  Attack  Attack On A Person            ASPLEY        2018-12
3  Animal  Attack                 NaN  JAMBOREE HEIGHTS        2018-12
4  Animal     Cat           Wandering          ASHGROVE        2018-12

In [40]:
#do some more inspection on Reporting Level and missing data
df_clean['Reporting_Level'].describe()

count         14182
unique           25
top       Wandering
freq           4292
Name: Reporting_Level, dtype: object

In [41]:
#decision taken to use the Mode as most frequent value to fill the missing data for Reporting_level
df_clean['Reporting_Level'] = df_clean['Reporting_Level'].fillna(df_clean['Reporting_Level'].mode()[0])

In [42]:
#check changes
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17072 entries, 0 to 2609
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Nature           17072 non-null  object
 1   Type             17072 non-null  object
 2   Reporting_Level  17072 non-null  object
 3   Suburb           17072 non-null  object
 4   Quarter_Ending   17072 non-null  object
dtypes: object(5)
memory usage: 800.2+ KB

In [43]:
#check if any data still missing
df_clean.isnull().sum().sum()

0

In [44]:
#re-check no missing values
df_clean.isnull().values.any()

False

In [45]:
#re-check the dataframe
df_clean.head()

   Nature    Type     Reporting_Level            Suburb Quarter_Ending
0  Animal     Cat           Wandering         GAYTHORNE        2018-12
1  Animal     Dog      Fencing Issues       CHAPEL HILL        2018-12
2  Animal  Attack  Attack On A Person            ASPLEY        2018-12
3  Animal  Attack           Wandering  JAMBOREE HEIGHTS        2018-12
4  Animal     Cat           Wandering          ASHGROVE        2018-12

In [46]:
# normalise the columns in terms of the column title case
df_clean.columns = [col.lower() for col in df_clean.columns]
df_clean.columns

Index(['nature', 'type', 'reporting_level', 'suburb', 'quarter_ending'], dtype='object')

In [47]:
#check new column titles
df_clean.describe()

        nature   type reporting_level suburb quarter_ending
count    17072  17072           17072  17072          17072
unique       1      5              25    187              8
top     Animal    Dog       Wandering  INALA        2020-06
freq     17072   8017            7182    563           2784

In [48]:
#re-check no missing values
df_clean.isnull().values.any()

False

In [49]:
#Find type, suburb, reporting level and QTR with most complaints
df_clean.mode()

   nature type reporting_level suburb quarter_ending
0  Animal  Dog       Wandering  INALA        2020-06

In [50]:
#upload this cleaned file as the base set of data for the analysis contained the total records over the 24 month (8 quarter period)
df_clean.to_csv(r'..\assignment\clean_2years_complaints.csv', index = False)

In [51]:
#We can already easily see that the most complaints are Dogs, most common complaint level is Wandering, most complaint suburb is Inala and biggest QTR is the Quarter ending June 2020

In [52]:
#Create new df with total data for the 2 year period to compare to Brisbane Local government population by suburb data to get per capita results
#Add all the 3 total categories by suburb for complaints, attacks and reporting office to match with LGA suburb population snapshot as of last Census

In [53]:
#We will also create additional data sets which create totals over different categories to help with the analysis and allow us to gain per capita information by suburb by joining the complaint data with ABS data on population by suburb

In [54]:
#Initial additional data set is total complaints by suburb for the 24 month period. New dataframe created preparing the suburb column to be used for data joining/merging
df_clean['suburb'].value_counts()

INALA               563
BRACKEN RIDGE       330
CHERMSIDE           304
FOREST LAKE         293
WYNNUM              258
                   ...
LAKE MANCHESTER       5
EAGLE FARM            5
MORETON ISLAND        2
TENNYSON              2
PORT OF BRISBANE      1
Name: suburb, Length: 187, dtype: int64

In [55]:
suburb_count = df_clean['suburb'].value_counts() 
print(suburb_count)

INALA               563
BRACKEN RIDGE       330
CHERMSIDE           304
FOREST LAKE         293
WYNNUM              258
                   ...
LAKE MANCHESTER       5
EAGLE FARM            5
MORETON ISLAND        2
TENNYSON              2
PORT OF BRISBANE      1
Name: suburb, Length: 187, dtype: int64

In [56]:
type(suburb_count)

pandas.core.series.Series

In [57]:
df_suburb_count = suburb_count.reset_index()
df_suburb_count

                index  suburb
0               INALA     563
1       BRACKEN RIDGE     330
2           CHERMSIDE     304
3         FOREST LAKE     293
4              WYNNUM     258
..                ...     ...
182   LAKE MANCHESTER       5
183        EAGLE FARM       5
184    MORETON ISLAND       2
185          TENNYSON       2
186  PORT OF BRISBANE       1

[187 rows x 2 columns]

In [58]:
#rename the columns to accurately reflect the data
df_suburb_count.rename(columns={'index': 'suburb', 'suburb': 'complaints'}, inplace=True)

In [59]:
df_suburb_count.head()

          suburb  complaints
0          INALA         563
1  BRACKEN RIDGE         330
2      CHERMSIDE         304
3    FOREST LAKE         293
4         WYNNUM         258

In [60]:
#df_suburb_count.set_index('suburb')

In [61]:
#check suburb column dtype is consistent to be able to use for merging dataframes
df_suburb_count.suburb.dtype

dtype('O')

In [62]:
#check no missing data
df_suburb_count.isna().sum()

suburb        0
complaints    0
dtype: int64

In [63]:
#check the new df
df_suburb_count.describe

<bound method NDFrame.describe of                suburb  complaints
0               INALA         563
1       BRACKEN RIDGE         330
2           CHERMSIDE         304
3         FOREST LAKE         293
4              WYNNUM         258
..                ...         ...
182   LAKE MANCHESTER           5
183        EAGLE FARM           5
184    MORETON ISLAND           2
185          TENNYSON           2
186  PORT OF BRISBANE           1

[187 rows x 2 columns]>

In [64]:
#create additional data set with total complaints by quarter for further analysis

In [65]:
df_clean['quarter_ending'].value_counts()

2020-06    2784
2020-09    2601
2019-09    2130
2020-03    2128
2019-06    1929
2018-12    1890
2019-12    1827
2019-03    1783
Name: quarter_ending, dtype: int64

In [66]:
complaints_by_qtr = df_clean['quarter_ending'].value_counts().iloc[::-1]

In [67]:
complaints_by_qtr

2019-03    1783
2019-12    1827
2018-12    1890
2019-06    1929
2020-03    2128
2019-09    2130
2020-09    2601
2020-06    2784
Name: quarter_ending, dtype: int64

In [68]:
df_complaints_by_qtr = complaints_by_qtr.to_frame().reset_index()
df_complaints_by_qtr

     index  quarter_ending
0  2019-03            1783
1  2019-12            1827
2  2018-12            1890
3  2019-06            1929
4  2020-03            2128
5  2019-09            2130
6  2020-09            2601
7  2020-06            2784

In [69]:
df_complaints_by_qtr.rename(columns={'index': 'quarter_ending', 'quarter_ending': 'total_complaints'}, inplace=True)

In [70]:
df_complaints_by_qtr

  quarter_ending  total_complaints
0        2019-03              1783
1        2019-12              1827
2        2018-12              1890
3        2019-06              1929
4        2020-03              2128
5        2019-09              2130
6        2020-09              2601
7        2020-06              2784

In [71]:
#save this file for further graphical analysis

In [72]:
df_complaints_by_qtr.to_csv(r'..\assignment\complaints_byqtr.csv', index = False)

In [73]:
#Create further data set which specifically shows the total number of complaints Types: Attack by quarter over the 2 year period

In [74]:
#Get value counts of the relevant columns and check the data
df_clean.value_counts(['quarter_ending', 'type'])

quarter_ending  type
2020-06         Dog             1612
2020-09         Dog             1392
2020-03         Dog             1131
2019-09         Dog              822
2019-12         Dog              781
2019-03         Dog              769
2018-12         Dog              768
2019-06         Dog              742
2019-09         Attack           597
2019-06         Attack           562
2020-06         Attack           549
2020-09         Attack           544
2019-03         Attack           483
2018-12         Attack           480
2020-03         Attack           476
2019-12         Attack           467
2020-09         Other Animal     314
2019-09         Other Animal     309
2018-12         Other Animal     304
2019-12         Other Animal     300
2020-06         Other Animal     295
2019-06         Other Animal     268
2019-09         Cat              241
2020-03         Other Animal     226
2019-03         Other Animal     218
2020-09         Cat              190
2019-06         Cat              190
2020-06         Cat              175
2018-12         Cat Trapping     171
2019-06         Cat Trapping     167
2018-12         Cat              167
2019-03         Cat              162
2020-03         Cat Trapping     162
2019-09         Cat Trapping     161
2020-09         Cat Trapping     161
2020-06         Cat Trapping     153
2019-03         Cat Trapping     151
2019-12         Cat Trapping     150
2020-03         Cat              133
2019-12         Cat              129
dtype: int64

In [75]:
#assign to new variable
attack_qtr = df_clean.value_counts(['quarter_ending', 'type'])
attack_qtr

quarter_ending  type
2020-06         Dog             1612
2020-09         Dog             1392
2020-03         Dog             1131
2019-09         Dog              822
2019-12         Dog              781
2019-03         Dog              769
2018-12         Dog              768
2019-06         Dog              742
2019-09         Attack           597
2019-06         Attack           562
2020-06         Attack           549
2020-09         Attack           544
2019-03         Attack           483
2018-12         Attack           480
2020-03         Attack           476
2019-12         Attack           467
2020-09         Other Animal     314
2019-09         Other Animal     309
2018-12         Other Animal     304
2019-12         Other Animal     300
2020-06         Other Animal     295
2019-06         Other Animal     268
2019-09         Cat              241
2020-03         Other Animal     226
2019-03         Other Animal     218
2020-09         Cat              190
2019-06         Cat              190
2020-06         Cat              175
2018-12         Cat Trapping     171
2019-06         Cat Trapping     167
2018-12         Cat              167
2019-03         Cat              162
2020-03         Cat Trapping     162
2019-09         Cat Trapping     161
2020-09         Cat Trapping     161
2020-06         Cat Trapping     153
2019-03         Cat Trapping     151
2019-12         Cat Trapping     150
2020-03         Cat              133
2019-12         Cat              129
dtype: int64

In [76]:
#drop the unnecessary values for Type which are not equal to 'Attack'
attack_qtr = attack_qtr.iloc[:-24]

In [77]:
attack_qtr = attack_qtr.iloc[8:]

In [78]:
attack_qtr.head(8)

quarter_ending  type
2019-09         Attack    597
2019-06         Attack    562
2020-06         Attack    549
2020-09         Attack    544
2019-03         Attack    483
2018-12         Attack    480
2020-03         Attack    476
2019-12         Attack    467
dtype: int64

In [79]:
df_hp = pd.DataFrame(attack_qtr)

In [80]:
#check the new df
df_hp.head(8)

                         0
quarter_ending type
2019-09        Attack  597
2019-06        Attack  562
2020-06        Attack  549
2020-09        Attack  544
2019-03        Attack  483
2018-12        Attack  480
2020-03        Attack  476
2019-12        Attack  467

In [81]:
#reset the index, double check the shape, drop unnecessary column and set new column titles
all_attack = df_hp.reset_index()
all_attack

  quarter_ending    type    0
0        2019-09  Attack  597
1        2019-06  Attack  562
2        2020-06  Attack  549
3        2020-09  Attack  544
4        2019-03  Attack  483
5        2018-12  Attack  480
6        2020-03  Attack  476
7        2019-12  Attack  467

In [82]:
all_attack.shape

(8, 3)

In [83]:
all_attack.columns = ['quarter_ending', 'type', 'attacks']
all_attack

  quarter_ending    type  attacks
0        2019-09  Attack      597
1        2019-06  Attack      562
2        2020-06  Attack      549
3        2020-09  Attack      544
4        2019-03  Attack      483
5        2018-12  Attack      480
6        2020-03  Attack      476
7        2019-12  Attack      467

In [84]:
del all_attack['type']
all_attack

  quarter_ending  attacks
0        2019-09      597
1        2019-06      562
2        2020-06      549
3        2020-09      544
4        2019-03      483
5        2018-12      480
6        2020-03      476
7        2019-12      467

In [85]:
all_attack = all_attack.sort_values(by ='quarter_ending', ascending=True)
all_attack

  quarter_ending  attacks
5        2018-12      480
4        2019-03      483
1        2019-06      562
0        2019-09      597
7        2019-12      467
6        2020-03      476
2        2020-06      549
3        2020-09      544

In [86]:
all_attack.info

<bound method DataFrame.info of   quarter_ending  attacks
5        2018-12      480
4        2019-03      483
1        2019-06      562
0        2019-09      597
7        2019-12      467
6        2020-03      476
2        2020-06      549
3        2020-09      544>

In [87]:
all_attack.columns

Index(['quarter_ending', 'attacks'], dtype='object')

In [88]:
#save this file for further graphical analysis

In [89]:
all_attack.to_csv(r'..\assignment\all_attacksf.csv')

In [90]:
#create further dataset to investigate totals over the 24 months for the category type 'Attacks' split by the suburb

In [91]:
#get the value counts for the relevant data columns similar to previous process
df_clean.value_counts(['suburb', 'type'])

suburb         type
INALA          Dog             267
CHERMSIDE      Dog             236
INALA          Attack          144
CARINA         Dog             129
FOREST LAKE    Dog             126
                              ...
DREWVALE       Cat Trapping      1
BALMORAL       Cat               1
EAGLE FARM     Cat Trapping      1
               Dog               1
HIGHGATE HILL  Cat               1
Length: 874, dtype: int64

In [92]:
attack_df = df_clean.value_counts(['suburb', 'type'])

In [93]:
attack_df

suburb         type
INALA          Dog             267
CHERMSIDE      Dog             236
INALA          Attack          144
CARINA         Dog             129
FOREST LAKE    Dog             126
                              ...
DREWVALE       Cat Trapping      1
BALMORAL       Cat               1
EAGLE FARM     Cat Trapping      1
               Dog               1
HIGHGATE HILL  Cat               1
Length: 874, dtype: int64

In [94]:
attack_dff = attack_df.reset_index()
attack_dff

            suburb          type    0
0            INALA           Dog  267
1        CHERMSIDE           Dog  236
2            INALA        Attack  144
3           CARINA           Dog  129
4      FOREST LAKE           Dog  126
..             ...           ...  ...
869       DREWVALE  Cat Trapping    1
870       BALMORAL           Cat    1
871     EAGLE FARM  Cat Trapping    1
872     EAGLE FARM           Dog    1
873  HIGHGATE HILL           Cat    1

[874 rows x 3 columns]

In [95]:
attack_dff.info

<bound method DataFrame.info of             suburb          type    0
0            INALA           Dog  267
1        CHERMSIDE           Dog  236
2            INALA        Attack  144
3           CARINA           Dog  129
4      FOREST LAKE           Dog  126
..             ...           ...  ...
869       DREWVALE  Cat Trapping    1
870       BALMORAL           Cat    1
871     EAGLE FARM  Cat Trapping    1
872     EAGLE FARM           Dog    1
873  HIGHGATE HILL           Cat    1

[874 rows x 3 columns]>

In [96]:
attack_dff[attack_dff.type.str.contains('Attack',case=True)]

            suburb    type    0
2            INALA  Attack  144
22   BRACKEN RIDGE  Attack   88
42     FOREST LAKE  Attack   69
46      TARRAGINDI  Attack   67
51    ACACIA RIDGE  Attack   64
..             ...     ...  ...
771         SUMNER  Attack    3
792   YEERONGPILLY  Attack    2
808         ALBION  Attack    2
812        BURBANK  Attack    2
816    BOWEN HILLS  Attack    2

[179 rows x 3 columns]

In [97]:
attack_pls = attack_dff[attack_dff.type.str.contains('Attack',case=True)]

In [98]:
attack_pls.head()

           suburb    type    0
2           INALA  Attack  144
22  BRACKEN RIDGE  Attack   88
42    FOREST LAKE  Attack   69
46     TARRAGINDI  Attack   67
51   ACACIA RIDGE  Attack   64

In [99]:
del attack_pls['type']

In [100]:
attack_pls.head()

           suburb    0
2           INALA  144
22  BRACKEN RIDGE   88
42    FOREST LAKE   69
46     TARRAGINDI   67
51   ACACIA RIDGE   64

In [101]:
df_attack_suburb = attack_pls.set_index('suburb')
df_attack_suburb

                 0
suburb
INALA          144
BRACKEN RIDGE   88
FOREST LAKE     69
TARRAGINDI      67
ACACIA RIDGE    64
...            ...
SUMNER           3
YEERONGPILLY     2
ALBION           2
BURBANK          2
BOWEN HILLS      2

[179 rows x 1 columns]

In [102]:
df_attack_suburb.rename(columns = {0:'attacks'}, inplace=True)

In [103]:
df_attack_suburb.reset_index(inplace=True)
df_attack_suburb

            suburb  attacks
0            INALA      144
1    BRACKEN RIDGE       88
2      FOREST LAKE       69
3       TARRAGINDI       67
4     ACACIA RIDGE       64
..             ...      ...
174         SUMNER        3
175   YEERONGPILLY        2
176         ALBION        2
177        BURBANK        2
178    BOWEN HILLS        2

[179 rows x 2 columns]

In [104]:
df_attack_suburb = df_attack_suburb.sort_values(by ='attacks', ascending=False)
df_attack_suburb.head(10)

            suburb  attacks
0            INALA      144
1    BRACKEN RIDGE       88
2      FOREST LAKE       69
3       TARRAGINDI       67
4     ACACIA RIDGE       64
5           WYNNUM       64
6         ZILLMERE       63
7     EVERTON PARK       59
8       MANLY WEST       59
9  SUNNYBANK HILLS       58

In [105]:
df_attack_suburb.head()

          suburb  attacks
0          INALA      144
1  BRACKEN RIDGE       88
2    FOREST LAKE       69
3     TARRAGINDI       67
4   ACACIA RIDGE       64

In [106]:
#check suburb column dtype to be used for merging dataframes with ABS population data for per capita analysis
df_attack_suburb.suburb.dtype

dtype('O')

In [107]:
#check no missing values
df_attack_suburb.isna().sum()

suburb     0
attacks    0
dtype: int64

In [108]:
df_attack_suburb.describe

<bound method NDFrame.describe of             suburb  attacks
0            INALA      144
1    BRACKEN RIDGE       88
2      FOREST LAKE       69
3       TARRAGINDI       67
4     ACACIA RIDGE       64
..             ...      ...
174         SUMNER        3
175   YEERONGPILLY        2
176         ALBION        2
177        BURBANK        2
178    BOWEN HILLS        2

[179 rows x 2 columns]>

In [109]:
#First attempt at matching complaint data with population data was using Brisbane City Council data which uses the 2016 Aus Census information to provide population by Local Government Area

In [110]:
#Brisbane City Council Local Gov Area data from website uploaded
Bris_LGApop_by_suburb = pd.read_csv('../Assignment/BNE_BCC_suburbs_by_pop.csv', header=None)

In [111]:
#Data checked and cleaned up on column titles and header cases
Bris_LGApop_by_suburb.columns = ["suburb", "population"]

In [112]:
Bris_LGApop_by_suburb.head()

     suburb  population
0    Albion        3542
1  Alderley        6618
2  Algester        9161
3  Annerley       12489
4     Ascot        5634

In [113]:
Bris_LGApop_by_suburb['suburb'] = Bris_LGApop_by_suburb['suburb'].str.upper()

In [114]:
Bris_LGApop_by_suburb.head()

     suburb  population
0    ALBION        3542
1  ALDERLEY        6618
2  ALGESTER        9161
3  ANNERLEY       12489
4     ASCOT        5634

In [115]:
#check dataset and data types for joing/merging with other data sets using the suburb columns values
Bris_LGApop_by_suburb.dtypes

suburb        object
population     int64
dtype: object

In [116]:
Bris_LGApop_by_suburb.describe

<bound method NDFrame.describe of                     suburb  population
0                   ALBION        3542
1                 ALDERLEY        6618
2                 ALGESTER        9161
3                 ANNERLEY       12489
4                    ASCOT        5634
..                     ...         ...
128   WOOLOOWIN - LUTWYCHE       11154
129                 WYNNUM       14466
130  WYNNUM WEST - HEMMANT       15738
131                YERONGA       10582
132               ZILLMERE        9623

[133 rows x 2 columns]>

In [117]:
#inspect the orignal Brisbane City Council suburb data. Can see they combine a number of suburbs which doesn't happen in the Animal Complaint data suburb data hence the join/ merging success rate would be impacted negatively
Bris_LGApop_by_suburb['suburb'].unique()

array(['ALBION', 'ALDERLEY', 'ALGESTER', 'ANNERLEY', 'ASCOT', 'ASHGROVE',
       'ASPLEY', 'AUCHENFLOWER', 'BALD HILLS', 'BALMORAL', 'BARDON',
       'BELLBOWRIE - MOGGILL', 'BELMONT - GUMDALE', 'BOONDALL',
       'BRACKEN RIDGE', 'BRIDGEMAN DOWNS', 'BRIGHTON (QLD)',
       'BRISBANE AIRPORT', 'BRISBANE CITY', 'BRISBANE PORT - LYTTON',
       'BROOKFIELD - KENMORE HILLS', 'BULIMBA', 'CALAMVALE - STRETTON',
       'CAMP HILL', 'CANNON HILL', 'CARINA', 'CARINA HEIGHTS',
       'CARINDALE', 'CARSELDINE', 'CHAPEL HILL', 'CHELMER - GRACEVILLE',
       'CHERMSIDE', 'CHERMSIDE WEST', 'CLAYFIELD', 'COOPERS PLAINS',
       'COORPAROO', 'CORINDA', 'DARRA - SUMNER', 'DEAGON', 'DURACK',
       'EAGLE FARM - PINKENBA', 'EAST BRISBANE', 'EIGHT MILE PLAINS',
       'ENOGGERA', 'ENOGGERA RESERVOIR', 'EVERTON PARK',
       'FAIRFIELD - DUTTON PARK', 'FIG TREE POCKET',
       'FOREST LAKE - DOOLANDELLA', 'FORTITUDE VALLEY', 'GEEBUNG',
       'GRANGE', 'GREENSLOPES', 'HAMILTON (QLD)', 'HAWTHORNE', 'HENDRA',
       'HIGHGATE HILL', 'HOLLAND PARK', 'HOLLAND PARK WEST',
       'INALA - RICHLANDS', 'INDOOROOPILLY', 'JINDALEE - MOUNT OMMANEY',
       'KANGAROO POINT', 'KARANA DOWNS', 'KEDRON - GORDON PARK',
       'KELVIN GROVE - HERSTON', 'KENMORE', 'KEPERRA', 'KURABY',
       'LAKE MANCHESTER - ENGLAND CREEK', 'MACGREGOR (QLD)',
       'MANLY - LOTA', 'MANLY WEST', 'MANSFIELD (QLD)', 'MCDOWALL',
       'MIDDLE PARK - JAMBOREE HEIGHTS', 'MOOROOKA',
       'MORNINGSIDE - SEVEN HILLS', 'MOUNT COOT-THA', 'MOUNT GRAVATT',
       'MURARRIE', 'NEW FARM', 'NEWMARKET', 'NEWSTEAD - BOWEN HILLS',
       'NORMAN PARK', 'NORTHGATE - VIRGINIA', 'NUDGEE - BANYO', 'NUNDAH',
       'OXLEY (QLD)', 'PADDINGTON - MILTON', 'PALLARA - WILLAWONG',
       'PARKINSON - DREWVALE', 'PINJARRA HILLS - PULLENVALE',
       'RED HILL (QLD)', 'RIVERHILLS', 'ROBERTSON', 'ROCHEDALE - BURBANK',
       'ROCKLEA - ACACIA RIDGE', 'RUNCORN', 'SALISBURY - NATHAN',
       'SANDGATE - SHORNCLIFFE', 'SCARBOROUGH - NEWPORT - MORETON ISLAND',
       'SEVENTEEN MILE ROCKS - SINNAMON PARK', 'SHERWOOD',
       'SOUTH BRISBANE', 'SPRING HILL', 'ST LUCIA', 'STAFFORD',
       'STAFFORD HEIGHTS', 'SUNNYBANK', 'SUNNYBANK HILLS',
       'TAIGUM - FITZGIBBON', 'TARINGA', 'TARRAGINDI', 'THE GAP',
       'TINGALPA', 'TOOWONG', 'UPPER KEDRON - FERNY GROVE',
       'UPPER MOUNT GRAVATT', 'WACOL', 'WAKERLEY', 'WAVELL HEIGHTS',
       'WEST END', 'WESTLAKE', 'WILSTON', 'WINDSOR', 'WISHART',
       'WOOLLOONGABBA', 'WOOLOOWIN - LUTWYCHE', 'WYNNUM',
       'WYNNUM WEST - HEMMANT', 'YERONGA', 'ZILLMERE'], dtype=object)

In [118]:
# only a total of 133 suburbs which INCLUDES the merged suburb populations (so actual success merges would be less than this) showing again the merging with complaints data would be less successful
Bris_LGApop_by_suburb.info

<bound method DataFrame.info of                     suburb  population
0                   ALBION        3542
1                 ALDERLEY        6618
2                 ALGESTER        9161
3                 ANNERLEY       12489
4                    ASCOT        5634
..                     ...         ...
128   WOOLOOWIN - LUTWYCHE       11154
129                 WYNNUM       14466
130  WYNNUM WEST - HEMMANT       15738
131                YERONGA       10582
132               ZILLMERE        9623

[133 rows x 2 columns]>

In [119]:
#Continue with Attempt 1 to start merging the revevant data sets

In [120]:
#merge the datasets for total complaints by suburb and total attacks by suburb using the suburb column values
df_suburbcounts_attack_join = pd.merge(df_suburb_count, df_attack_suburb,on='suburb',how='outer')
df_suburbcounts_attack_join

               suburb  complaints  attacks
0               INALA         563    144.0
1       BRACKEN RIDGE         330     88.0
2           CHERMSIDE         304     35.0
3         FOREST LAKE         293     69.0
4              WYNNUM         258     64.0
..                ...         ...      ...
182   LAKE MANCHESTER           5      NaN
183        EAGLE FARM           5      NaN
184    MORETON ISLAND           2      NaN
185          TENNYSON           2      NaN
186  PORT OF BRISBANE           1      NaN

[187 rows x 3 columns]

In [121]:
#check missing data. Accepted that some suburbs might have zero attacks over the 24 month period
df_suburbcounts_attack_join.isna().sum()

suburb        0
complaints    0
attacks       8
dtype: int64

In [122]:
#now merge this data set with the population by suburb data from Bris City Council to allow per capita complaint calculations. This is joining/merging which is a problem due to the different suburb definitions
df_pop_attack_count_join = pd.merge(df_suburbcounts_attack_join, Bris_LGApop_by_suburb, on='suburb',how='outer')
df_pop_attack_count_join

                                   suburb  complaints  attacks  population
0                                   INALA       563.0    144.0         NaN
1                           BRACKEN RIDGE       330.0     88.0     17825.0
2                               CHERMSIDE       304.0     35.0     10425.0
3                             FOREST LAKE       293.0     69.0         NaN
4                                  WYNNUM       258.0     64.0     14466.0
..                                    ...         ...      ...         ...
224  SEVENTEEN MILE ROCKS - SINNAMON PARK         NaN      NaN      9929.0
225                   TAIGUM - FITZGIBBON         NaN      NaN     14302.0
226            UPPER KEDRON - FERNY GROVE         NaN      NaN     11175.0
227                  WOOLOOWIN - LUTWYCHE         NaN      NaN     11154.0
228                 WYNNUM WEST - HEMMANT         NaN      NaN     15738.0

[229 rows x 4 columns]

In [123]:
#check the number of rows with at least one missing value. This is high the number of total suburbs was c.180
sum(df_pop_attack_count_join.apply(lambda x: sum(x.isnull().values), axis = 1)>0)

139

In [124]:
#checking new joined data and missing values
df_pop_attack_count_join.isna().sum()

suburb         0
complaints    42
attacks       50
population    96
dtype: int64

In [125]:
df_pop_attack_count_join.describe

<bound method NDFrame.describe of                                    suburb  complaints  attacks  population
0                                   INALA       563.0    144.0         NaN
1                           BRACKEN RIDGE       330.0     88.0     17825.0
2                               CHERMSIDE       304.0     35.0     10425.0
3                             FOREST LAKE       293.0     69.0         NaN
4                                  WYNNUM       258.0     64.0     14466.0
..                                    ...         ...      ...         ...
224  SEVENTEEN MILE ROCKS - SINNAMON PARK         NaN      NaN      9929.0
225                   TAIGUM - FITZGIBBON         NaN      NaN     14302.0
226            UPPER KEDRON - FERNY GROVE         NaN      NaN     11175.0
227                  WOOLOOWIN - LUTWYCHE         NaN      NaN     11154.0
228                 WYNNUM WEST - HEMMANT         NaN      NaN     15738.0

[229 rows x 4 columns]>

In [126]:
## Given the issues in matching by suburb, decision taken to investigate new suburb population data which better matches the Animal complaint data suburb definitions.

In [127]:
#new data set with population counts for all of QLD idenified from ABS website via their table builder using 2016 Census data for suburb. 
ABS_qldsuburbs_pop = pd.read_csv('../Assignment/table_ABS_qld_suburbs.csv', header=None)

In [128]:
#new data set checked. Can see some suburb have (Qld) after their name which is problem for joining. 
ABS_qldsuburbs_pop.head(8)

                  0     1
0         Abbeywood    20
1  Abbotsford (Qld)     0
2          Abercorn    42
3        Abergowrie   434
4    Abingdon Downs     0
5    Abington (Qld)    57
6      Acacia Ridge  7430
7            Acland    27

In [129]:
#tidy up column names and check data types
ABS_qldsuburbs_pop.columns = ["suburb", "population"]

In [130]:
ABS_qldsuburbs_pop.head()

             suburb  population
0         Abbeywood          20
1  Abbotsford (Qld)           0
2          Abercorn          42
3        Abergowrie         434
4    Abingdon Downs           0

In [131]:
ABS_qldsuburbs_pop.dtypes

suburb        object
population     int64
dtype: object

In [132]:
ABS_qldsuburbs_pop['suburb'] = ABS_qldsuburbs_pop['suburb'].str.upper()

In [133]:
ABS_qldsuburbs_pop.head()

             suburb  population
0         ABBEYWOOD          20
1  ABBOTSFORD (QLD)           0
2          ABERCORN          42
3        ABERGOWRIE         434
4    ABINGDON DOWNS           0

In [134]:
#clean to aid joining success rate by removing (Qld) from all suburb values.
ABS_qldsuburbs_pop['suburb'] = ABS_qldsuburbs_pop['suburb'].str.replace(r"\(.*\)","")
ABS_qldsuburbs_pop

              suburb  population
0          ABBEYWOOD          20
1        ABBOTSFORD            0
2           ABERCORN          42
3         ABERGOWRIE         434
4     ABINGDON DOWNS           0
...              ...         ...
3255    YULEBA SOUTH          20
3256      YUNGABURRA        1234
3257          YURUGA          76
3258        ZILLMERE        8968
3259          ZILZIE        2710

[3260 rows x 2 columns]

In [135]:
#Now commence Attempt 2 to join/merge the new ABS population data with total Animal Complaint Data counts by suburb for attacks and complaints
Joining_ABS_pop = pd.merge(df_suburbcounts_attack_join, ABS_qldsuburbs_pop, on='suburb',how='outer')
Joining_ABS_pop

             suburb  complaints  attacks  population
0             INALA       563.0    144.0     14852.0
1     BRACKEN RIDGE       330.0     88.0     16935.0
2         CHERMSIDE       304.0     35.0      9315.0
3       FOREST LAKE       293.0     69.0     22898.0
4            WYNNUM       258.0     64.0     12910.0
...             ...         ...      ...         ...
3297   YULEBA NORTH         NaN      NaN        62.0
3298   YULEBA SOUTH         NaN      NaN        20.0
3299     YUNGABURRA         NaN      NaN      1234.0
3300         YURUGA         NaN      NaN        76.0
3301         ZILZIE         NaN      NaN      2710.0

[3302 rows x 4 columns]

In [136]:
#on first view, the Attempt 2 join rate looks more successful from Attempt 1

In [137]:
#check the outcome and missing data
Joining_ABS_pop.isna().sum()

suburb           0
complaints    3115
attacks       3123
population      42
dtype: int64

In [138]:
Joining_ABS_pop.describe

<bound method NDFrame.describe of              suburb  complaints  attacks  population
0             INALA       563.0    144.0     14852.0
1     BRACKEN RIDGE       330.0     88.0     16935.0
2         CHERMSIDE       304.0     35.0      9315.0
3       FOREST LAKE       293.0     69.0     22898.0
4            WYNNUM       258.0     64.0     12910.0
...             ...         ...      ...         ...
3297   YULEBA NORTH         NaN      NaN        62.0
3298   YULEBA SOUTH         NaN      NaN        20.0
3299     YUNGABURRA         NaN      NaN      1234.0
3300         YURUGA         NaN      NaN        76.0
3301         ZILZIE         NaN      NaN      2710.0

[3302 rows x 4 columns]>

In [139]:
missing_values_abs = (Joining_ABS_pop.isna().sum() / Joining_ABS_pop.shape[0]) * 100
missing_values_abs

suburb         0.000000
complaints    94.336766
attacks       94.579043
population     1.271956
dtype: float64

In [140]:
Joining_ABS_pop.shape

(3302, 4)

In [141]:
#decision taken to drop rows with no joined suburb data to get an indication of remaining data versus Attempt 1 join rate
cleaned_abs_join = Joining_ABS_pop.dropna().copy()
cleaned_abs_join

               suburb  complaints  attacks  population
0               INALA       563.0    144.0     14852.0
1       BRACKEN RIDGE       330.0     88.0     16935.0
2           CHERMSIDE       304.0     35.0      9315.0
3         FOREST LAKE       293.0     69.0     22898.0
4              WYNNUM       258.0     64.0     12910.0
..                ...         ...      ...         ...
172            SUMNER        19.0      3.0       590.0
173  FORTITUDE VALLEY        18.0      3.0      6974.0
175           RANSOME        14.0      4.0       405.0
178      YEERONGPILLY        10.0      2.0      1934.0
179            CHUWAR         8.0      3.0      2245.0

[138 rows x 4 columns]

In [142]:
# 138 suburb matches appear successful from the c.180 total suburbs which was higher than the rate for Brisbane City Council LGA data so decision take to go with this data for the per capita analysis

In [143]:
#calculation columns added to the new Attempt 2 joined up data from to show the relative complaints and attack percentages versus the population sizes. 

cleaned_abs_join['complaint % of Pop'] = (cleaned_abs_join['complaints'] / cleaned_abs_join['population']).round(4)*100
cleaned_abs_join

               suburb  complaints  attacks  population  complaint % of Pop
0               INALA       563.0    144.0     14852.0                3.79
1       BRACKEN RIDGE       330.0     88.0     16935.0                1.95
2           CHERMSIDE       304.0     35.0      9315.0                3.26
3         FOREST LAKE       293.0     69.0     22898.0                1.28
4              WYNNUM       258.0     64.0     12910.0                2.00
..                ...         ...      ...         ...                 ...
172            SUMNER        19.0      3.0       590.0                3.22
173  FORTITUDE VALLEY        18.0      3.0      6974.0                0.26
175           RANSOME        14.0      4.0       405.0                3.46
178      YEERONGPILLY        10.0      2.0      1934.0                0.52
179            CHUWAR         8.0      3.0      2245.0                0.36

[138 rows x 5 columns]

In [144]:
cleaned_abs_join['attacks % of Pop'] = (cleaned_abs_join['attacks'] / cleaned_abs_join['population']).round(4)*100
cleaned_abs_join

,suburb,complaints,attacks,population,complaint % of Pop,attacks % of Pop
0,INALA,563.0,144.0,14852.0,3.79,0.97
1,BRACKEN RIDGE,330.0,88.0,16935.0,1.95,0.52
2,CHERMSIDE,304.0,35.0,9315.0,3.26,0.38
3,FOREST LAKE,293.0,69.0,22898.0,1.28,0.30
4,WYNNUM,258.0,64.0,12910.0,2.00,0.50
...,...,...,...,...,...,...
172,SUMNER,19.0,3.0,590.0,3.22,0.51
173,FORTITUDE VALLEY,18.0,3.0,6974.0,0.26,0.04
175,RANSOME,14.0,4.0,405.0,3.46,0.99
178,YEERONGPILLY,10.0,2.0,1934.0,0.52,0.10
179,CHUWAR,8.0,3.0,2245.0,0.36,0.13

In [146]:
#joined up final dataset uploaded for later graphical analysis
cleaned_abs_join.to_csv(r'..\assignment\two_years_complaints_percap.csv', index = False)

In [149]:
#end of main cleaning